zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_adc.h
/*!
    \file    gd32c2x1_adc.h
    \brief   definitions for the ADC

    \version 2025-08-08, V1.1.0, firmware for gd32c2x1
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32C2X1_ADC_H
#define GD32C2X1_ADC_H

#include "gd32c2x1.h"

/* ADC definitions */
#define ADC                                                ADC_BASE                                    /*!< ADC base address */

/* registers definitions */
#define ADC_STAT                                           REG32(ADC + 0x00000000U)                    /*!< ADC status register */
#define ADC_CTL0                                           REG32(ADC + 0x00000004U)                    /*!< ADC control register 0 */
#define ADC_CTL1                                           REG32(ADC + 0x00000008U)                    /*!< ADC control register 1 */
#define ADC_SAMPT0                                         REG32(ADC + 0x0000000CU)                    /*!< ADC sample time register 0 */
#define ADC_SAMPT1                                         REG32(ADC + 0x00000010U)                    /*!< ADC sample time register 1 */
#define ADC_IOFF0                                          REG32(ADC + 0x00000014U)                    /*!< ADC inserted channel data offset register 0 */
#define ADC_IOFF1                                          REG32(ADC + 0x00000018U)                    /*!< ADC inserted channel data offset register 1 */
#define ADC_IOFF2                                          REG32(ADC + 0x0000001CU)                    /*!< ADC inserted channel data offset register 2 */
#define ADC_IOFF3                                          REG32(ADC + 0x00000020U)                    /*!< ADC inserted channel data offset register 3 */
#define ADC_WD0HT                                          REG32(ADC + 0x00000024U)                    /*!< ADC watchdog 0 high threshold register */
#define ADC_WD0LT                                          REG32(ADC + 0x00000028U)                    /*!< ADC watchdog 0 low threshold register */
#define ADC_RSQ0                                           REG32(ADC + 0x0000002CU)                    /*!< ADC routine sequence register 0 */
#define ADC_RSQ1                                           REG32(ADC + 0x00000030U)                    /*!< ADC routine sequence register 1 */
#define ADC_RSQ2                                           REG32(ADC + 0x00000034U)                    /*!< ADC routine sequence register 2 */
#define ADC_ISQ                                            REG32(ADC + 0x00000038U)                    /*!< ADC inserted sequence register */
#define ADC_IDATA0                                         REG32(ADC + 0x0000003CU)                    /*!< ADC inserted data register 0 */
#define ADC_IDATA1                                         REG32(ADC + 0x00000040U)                    /*!< ADC inserted data register 1 */
#define ADC_IDATA2                                         REG32(ADC + 0x00000044U)                    /*!< ADC inserted data register 2 */
#define ADC_IDATA3                                         REG32(ADC + 0x00000048U)                    /*!< ADC inserted data register 3 */
#define ADC_RDATA                                          REG32(ADC + 0x0000004CU)                    /*!< ADC routine data register */
#define ADC_WD1SR                                          REG32(ADC + 0x00000050U)                    /*!< ADC watchdog 1 channel selection register */
#define ADC_WD2SR                                          REG32(ADC + 0x00000054U)                    /*!< ADC watchdog 2 channel selection register */
#define ADC_WD1HT                                          REG32(ADC + 0x00000058U)                    /*!< ADC watchdog 1 high threshold register */
#define ADC_WD1LT                                          REG32(ADC + 0x0000005CU)                    /*!< ADC watchdog 1 low threshold register */
#define ADC_WD2HT                                          REG32(ADC + 0x00000060U)                    /*!< ADC watchdog 2 high threshold register */
#define ADC_WD2LT                                          REG32(ADC + 0x00000064U)                    /*!< ADC watchdog 2 low threshold register */
#define ADC_OVSAMPCTL                                      REG32(ADC + 0x00000080U)                    /*!< ADC oversample control register */

/* bits definitions */
/* ADC_STAT */
#define ADC_STAT_WD0E                                      BIT(0)                                      /*!< analog watchdog 0 event flag */
#define ADC_STAT_EOC                                       BIT(1)                                      /*!< end of sequence conversion */
#define ADC_STAT_EOIC                                      BIT(2)                                      /*!< end of inserted sequence conversion */
#define ADC_STAT_STIC                                      BIT(3)                                      /*!< inserted sequence start flag */
#define ADC_STAT_STRC                                      BIT(4)                                      /*!< routine sequence start flag */
#define ADC_STAT_WD1E                                      BIT(30)                                     /*!< analog watchdog 1 event flag */
#define ADC_STAT_WD2E                                      BIT(31)                                     /*!< analog watchdog 2 event flag */

/* ADC_CTL0 */
#define ADC_CTL0_WD0CHSEL                                  BITS(0, 3)                                  /*!< analog watchdog 0 channel select */
#define ADC_CTL0_EOCIE                                     BIT(5)                                      /*!< interrupt enable for EOC */
#define ADC_CTL0_WD0EIE                                    BIT(6)                                      /*!< analog watchdog 0 interrupt enable */
#define ADC_CTL0_EOICIE                                    BIT(7)                                      /*!< interrupt enable for EOIC */
#define ADC_CTL0_SM                                        BIT(8)                                      /*!< scan mode */
#define ADC_CTL0_WD0SC                                     BIT(9)                                      /*!< when in scan mode, analog watchdog 0 is effective on a single channel */
#define ADC_CTL0_ICA                                       BIT(10)                                     /*!< automatic inserted sequence conversion */
#define ADC_CTL0_DISRC                                     BIT(11)                                     /*!< discontinuous mode on routine channels */
#define ADC_CTL0_DISIC                                     BIT(12)                                     /*!< discontinuous mode on inserted channels */
#define ADC_CTL0_DISNUM                                    BITS(13, 15)                                /*!< discontinuous mode channel number */
#define ADC_CTL0_IWD0EN                                    BIT(22)                                     /*!< analog watchdog 0 enable on inserted channels */
#define ADC_CTL0_RWD0EN                                    BIT(23)                                     /*!< analog watchdog 0 enable on routine channels */
#define ADC_CTL0_DRES                                      BITS(24, 25)                                /*!< ADC resolution */
#define ADC_CTL0_WD1EIE                                    BIT(30)                                     /*!< analog watchdog 1 interrupt enable */
#define ADC_CTL0_WD2EIE                                    BIT(31)                                     /*!< analog watchdog 2 interrupt enable */

/* ADC_CTL1 */
#define ADC_CTL1_ADCON                                     BIT(0)                                      /*!< ADC converter on */
#define ADC_CTL1_CTN                                       BIT(1)                                      /*!< continuous mode */
#define ADC_CTL1_DMA                                       BIT(8)                                      /*!< dma request enable */
#define ADC_CTL1_DAL                                       BIT(11)                                     /*!< data alignment */
#define ADC_CTL1_ETSIC                                     BITS(12, 14)                                /*!< external trigger select for inserted channel */
#define ADC_CTL1_ETEIC                                     BIT(15)                                     /*!< external trigger enable for inserted channel */
#define ADC_CTL1_ETSRC                                     BITS(17, 19)                                /*!< external trigger select for routine channel */
#define ADC_CTL1_ETERC                                     BIT(20)                                     /*!< external trigger enable for routine channel */
#define ADC_CTL1_SWICST                                    BIT(21)                                     /*!< software start on inserted channels */
#define ADC_CTL1_SWRCST                                    BIT(22)                                     /*!< software start on routine channels */
#define ADC_CTL1_TSVEN                                     BIT(23)                                     /*!< channel 13(temperature sensor)enable of ADC */
#define ADC_CTL1_INREFEN                                   BIT(24)                                     /*!< channel 14(internal reference voltage)enable of ADC */

/* ADC_SAMPTx x=0..1 */
#define ADC_SAMPTX_SPTN                                    BITS(0, 2)                                  /*!< channel n(n=0..10 or 0..15) sampling time selection */

