zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_adc.h
/* ADC_IOFFx x=0..3 */
#define ADC_IOFFX_IOFF                                     BITS(0, 11)                                 /*!< data offset for inserted channel x */

/* ADC_WD0HT */
#define ADC_WD0HT_WD0HT                                    BITS(0, 11)                                 /*!< high threshold for analog watchdog 0 */

/* ADC_WD0LT */
#define ADC_WD0LT_WD0LT                                    BITS(0, 11)                                 /*!< low threshold for analog watchdog 0 */

/* ADC_RSQx x=0..2 */
#define ADC_RSQX_RSQN                                      BITS(0, 3)                                  /*!< nth(n=0..10 or 0..15) conversion in routine sequence */
#define ADC_RSQ0_RL                                        BITS(20, 23)                                /*!< routine sequence length */

/* ADC_ISQ */
#define ADC_ISQ_ISQN                                       BITS(0, 3)                                  /*!< nth(n = 0..3) conversion in inserted sequence */
#define ADC_ISQ_IL                                         BITS(20, 21)                                /*!< inserted sequence length */

/* ADC_IDATAx x=0..3*/
#define ADC_IDATAX_IDATAN                                  BITS(0, 15)                                 /*!< inserted channel x conversion data */

/* ADC_RDATA */
#define ADC_RDATA_RDATA                                    BITS(0, 15)                                 /*!< routine channel data */

/* ADC_WD1SR */
#define ADC_WD1SR_AWD1CS                                   BITS(0, 15)                                 /*!< analog watchdog 1 channel selection */
/* ADC_WD2SR */
#define ADC_WD2SR_AWD2CS                                   BITS(0, 15)                                 /*!< analog watchdog 2 channel selection */

/* ADC_WD1HT */
#define ADC_WD1HT_WD1HT                                    BITS(0, 11)                                 /*!< high threshold for analog watchdog 1 */

/* ADC_WD1LT */
#define ADC_WD1LT_WD1LT                                    BITS(0, 11)                                 /*!< low threshold for analog watchdog 1 */

/* ADC_WD2HT */
#define ADC_WD2HT_WD2HT                                    BITS(0, 11)                                 /*!< high threshold for analog watchdog 2 */

/* ADC_WD2LT */
#define ADC_WD2LT_WD2LT                                    BITS(0, 11)                                 /*!< low threshold for analog watchdog 2 */

/* ADC_OVSAMPCTL */
#define ADC_OVSAMPCTL_OVSEN                                BIT(0)                                      /*!< oversampling enable */
#define ADC_OVSAMPCTL_OVSR                                 BITS(2, 4)                                  /*!< oversampling ratio */
#define ADC_OVSAMPCTL_OVSS                                 BITS(5, 8)                                  /*!< oversampling shift */
#define ADC_OVSAMPCTL_TOVS                                 BIT(9)                                      /*!< triggered oversampling */

/* constants definitions */
/* ADC_CTL0 register value */
#define CTL0_DISNUM(regval)                                (BITS(13, 15) & ((uint32_t)(regval) << 13)) /*!< write value to ADC_CTL0_DISNUM bit field */

/* ADC resolution configure */
#define CTL0_DRES(regval)                                  (BITS(24, 25) & ((uint32_t)(regval) << 24))
#define ADC_RESOLUTION_12B                                 CTL0_DRES(0)                                /*!< 12-bit ADC resolution */
#define ADC_RESOLUTION_10B                                 CTL0_DRES(1)                                /*!< 10-bit ADC resolution */
#define ADC_RESOLUTION_8B                                  CTL0_DRES(2)                                /*!< 8-bit ADC resolution */
#define ADC_RESOLUTION_6B                                  CTL0_DRES(3)                                /*!< 6-bit ADC resolution */

/* ADC special function definitions */
#define ADC_SCAN_MODE                                      ADC_CTL0_SM                                 /*!< scan mode */
#define ADC_INSERTED_CHANNEL_AUTO                          ADC_CTL0_ICA                                /*!< inserted sequence convert automatically */
#define ADC_CONTINUOUS_MODE                                ADC_CTL1_CTN                                /*!< continuous mode */

/* temperature sensor channel, internal reference voltage channel */
#define ADC_CHANNEL_INTERNAL_TEMPSENSOR                    ADC_CTL1_TSVEN                              /*!< temperature channel */
#define ADC_CHANNEL_INTERNAL_VREFINT                       ADC_CTL1_INREFEN                            /*!< internal vrefint channel */

/* ADC data alignment */
#define ADC_DATAALIGN_RIGHT                                ((uint32_t)0x00000000U)                     /*!< LSB alignment */
#define ADC_DATAALIGN_LEFT                                 ADC_CTL1_DAL                                /*!< MSB alignment */

/* ADC external trigger select for routine sequence */
#define CTL1_ETSRC(regval)                                 (BITS(17, 19) & ((uint32_t)(regval) << 17))
#define ADC_EXTTRIG_ROUTINE_T2_CH1                         CTL1_ETSRC(0)                               /*!< TIMER2 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH2                         CTL1_ETSRC(1)                               /*!< TIMER0 CH2 event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH1                         CTL1_ETSRC(2)                               /*!< TIMER0 CH1 event select */
#define ADC_EXTTRIG_ROUTINE_T2_TRGO                        CTL1_ETSRC(3)                               /*!< TIMER2 TRGO event select */
#define ADC_EXTTRIG_ROUTINE_T0_CH0                         CTL1_ETSRC(4)                               /*!< TIMER0 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_T2_CH0                         CTL1_ETSRC(5)                               /*!< TIMER2 CH0 event select */
#define ADC_EXTTRIG_ROUTINE_EXTI_11                        CTL1_ETSRC(6)                               /*!< external interrupt line 11 select  */
#define ADC_EXTTRIG_ROUTINE_NONE                           CTL1_ETSRC(7)                               /*!< software trigger select  */

/* ADC external trigger select for inserted sequence */
#define CTL1_ETSIC(regval)                                 (BITS(12, 14) & ((uint32_t)(regval) << 12))
#define ADC_EXTTRIG_INSERTED_T0_TRGO                       CTL1_ETSIC(0)                               /*!< TIMER0 TRGO event select */
#define ADC_EXTTRIG_INSERTED_T0_CH3                        CTL1_ETSIC(1)                               /*!< TIMER0 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T13_CH0                       CTL1_ETSIC(2)                               /*!< TIMER13 CH0 event select */
#define ADC_EXTTRIG_INSERTED_T2_CH3                        CTL1_ETSIC(3)                               /*!< TIMER2 CH3 event select */
#define ADC_EXTTRIG_INSERTED_T2_CH2                        CTL1_ETSIC(4)                               /*!< TIMER2 CH2 event select */
#define ADC_EXTTRIG_INSERTED_T15_CH0                       CTL1_ETSIC(5)                               /*!< TIMER15 CH0 event select */
#define ADC_EXTTRIG_INSERTED_EXTI_15                       CTL1_ETSIC(6)                               /*!< external interrupt line 15 */
#define ADC_EXTTRIG_INSERTED_NONE                          CTL1_ETSIC(7)                               /*!< software trigger select */

