zephyrproject-rtos/hal_gigadevice/gd32c2x1/standard_peripheral/include/gd32c2x1_adc.h
/* ADC channel sample time */
#define SAMPTX_SPT(regval)                                 (BITS(0, 2) & ((uint32_t)(regval) << 0))    /*!< write value to ADC_SAMPTX_SPT bit field */
#define ADC_SAMPLETIME_2POINT5                             SAMPTX_SPT(0)                               /*!< 2.5 sampling cycles */
#define ADC_SAMPLETIME_3POINT5                             SAMPTX_SPT(1)                               /*!< 3.5 sampling cycles */
#define ADC_SAMPLETIME_7POINT5                             SAMPTX_SPT(2)                               /*!< 7.5 sampling cycles */
#define ADC_SAMPLETIME_12POINT5                            SAMPTX_SPT(3)                               /*!< 12.5 sampling cycles */
#define ADC_SAMPLETIME_19POINT5                            SAMPTX_SPT(4)                               /*!< 19.5 sampling cycles */
#define ADC_SAMPLETIME_39POINT5                            SAMPTX_SPT(5)                               /*!< 39.5 sampling cycles */
#define ADC_SAMPLETIME_79POINT5                            SAMPTX_SPT(6)                               /*!< 79.5 sampling cycles */
#define ADC_SAMPLETIME_160POINT5                           SAMPTX_SPT(7)                               /*!< 160.5 sampling cycles */

/* ADC_IOFFX register value */
#define IOFFX_IOFF(regval)                                 (BITS(0, 11) & ((uint32_t)(regval) << 0))   /*!< write value to ADC_IOFFX_IOFF bit field */

/* ADC high threshold for analog watchdog 0 */
#define WD0HT_WD0HT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD0HT_WD0HT bit field */

/* ADC low threshold for analog watchdog 0 */
#define WD0LT_WD0LT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD0LT_WD0LT bit field */

/* ADC high threshold for analog watchdog 1 */
#define WD1HT_WD1HT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD1HT_WD1HT bit field */

/* ADC low threshold for analog watchdog 1 */
#define WD1LT_WD1LT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD1LT_WD1LT bit field */

/* ADC high threshold for analog watchdog 2 */
#define WD2HT_WD2HT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD2HT_WD2HT bit field */

/* ADC low threshold for analog watchdog 2 */
#define WD2LT_WD2LT(regval)                                (BITS(0,11) & ((uint32_t)(regval) << 0U))   /*!< write value to ADC_WD2LT_WD2LT bit field */

/* ADC_RSQX register value */
#define RSQ0_RL(regval)                                    (BITS(20, 23) & ((uint32_t)(regval) << 20)) /*!< write value to ADC_RSQ0_RL bit field */

/* ADC_ISQ register value */
#define ISQ_IL(regval)                                     (BITS(20, 21) & ((uint32_t)(regval) << 20)) /*!< write value to ADC_ISQ_IL bit field */

/* ADC_OVSAMPCTL register value */
/* oversampling shift */
#define OVSAMPCTL_OVSS(regval)                             (BITS(5, 8) & ((uint32_t)(regval) << 5))    /*!< write value to ADC_OVSAMPCTL_OVSS bit field */
#define ADC_OVERSAMPLING_SHIFT_NONE                        OVSAMPCTL_OVSS(0)                           /*!< no oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_1B                          OVSAMPCTL_OVSS(1)                           /*!< 1-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_2B                          OVSAMPCTL_OVSS(2)                           /*!< 2-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_3B                          OVSAMPCTL_OVSS(3)                           /*!< 3-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_4B                          OVSAMPCTL_OVSS(4)                           /*!< 4-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_5B                          OVSAMPCTL_OVSS(5)                           /*!< 5-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_6B                          OVSAMPCTL_OVSS(6)                           /*!< 6-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_7B                          OVSAMPCTL_OVSS(7)                           /*!< 7-bit oversampling shift */
#define ADC_OVERSAMPLING_SHIFT_8B                          OVSAMPCTL_OVSS(8)                           /*!< 8-bit oversampling shift */

/* oversampling ratio */
#define OVSAMPCTL_OVSR(regval)                             (BITS(2, 4) & ((uint32_t)(regval) << 2))    /*!< write value to ADC_OVSAMPCTL_OVSR bit field */
#define ADC_OVERSAMPLING_RATIO_MUL2                        OVSAMPCTL_OVSR(0)                           /*!< oversampling ratio multiple 2 */
#define ADC_OVERSAMPLING_RATIO_MUL4                        OVSAMPCTL_OVSR(1)                           /*!< oversampling ratio multiple 4 */
#define ADC_OVERSAMPLING_RATIO_MUL8                        OVSAMPCTL_OVSR(2)                           /*!< oversampling ratio multiple 8 */
#define ADC_OVERSAMPLING_RATIO_MUL16                       OVSAMPCTL_OVSR(3)                           /*!< oversampling ratio multiple 16 */
#define ADC_OVERSAMPLING_RATIO_MUL32                       OVSAMPCTL_OVSR(4)                           /*!< oversampling ratio multiple 32 */
#define ADC_OVERSAMPLING_RATIO_MUL64                       OVSAMPCTL_OVSR(5)                           /*!< oversampling ratio multiple 64 */
#define ADC_OVERSAMPLING_RATIO_MUL128                      OVSAMPCTL_OVSR(6)                           /*!< oversampling ratio multiple 128 */
#define ADC_OVERSAMPLING_RATIO_MUL256                      OVSAMPCTL_OVSR(7)                           /*!< oversampling ratio multiple 256 */

/* triggered oversampling */
#define ADC_OVERSAMPLING_ALL_CONVERT                       ((uint32_t)0x00000000U)                     /*!< all oversampled conversions for a channel are done consecutively after a trigger */
#define ADC_OVERSAMPLING_ONE_CONVERT                       ADC_OVSAMPCTL_TOVS                          /*!< each oversampled conversion for a channel needs a trigger */

/* ADC channel sequence definitions */
#define ADC_ROUTINE_CHANNEL                                ((uint8_t)0x01U)                            /*!< ADC routine sequence */
#define ADC_INSERTED_CHANNEL                               ((uint8_t)0x02U)                            /*!< ADC inserted sequence */
#define ADC_ROUTINE_INSERTED_CHANNEL                       ((uint8_t)0x03U)                            /*!< both routine and inserted sequence */
#define ADC_CHANNEL_DISCON_DISABLE                         ((uint8_t)0x04U)                            /*!< disable discontinuous mode of routine & inserted sequence */

